#!/usr/bin/env python
# encoding: utf-8
# this is list of Thai stop words drawn originally from Apache Lucene
# ref: originally

THAI_STOP_WORDS = frozenset([
    u'ไว้', u'ไม่', u'ไป', u'ได้', u'ให้', u'ใน', u'โดย', u'แห่ง',
    u'แล้ว', u'และ', u'แรก', u'แบบ', u'แต่', u'เอง', u'เห็น',
    u'เลย', u'เริ่ม', u'เรา', u'เมื่อ', u'เพื่อ', u'เพราะ', u'เป็นการ',
    u'เป็น', u'เปิดเผย', u'เปิด', u'เนื่องจาก', u'เดียวกัน', u'เดียว',
    u'เช่น', u'เฉพาะ', u'เคย', u'เข้า', u'เขา', u'อีก', u'อาจ',
    u'อะไร', u'ออก', u'อย่าง', u'อยู่', u'อยาก', u'หาก', u'หลาย',
    u'หลังจาก', u'หลัง', u'หรือ', u'หนึ่ง', u'ส่วน', u'ส่ง', u'สุด',
    u'สําหรับ', u'ว่า', u'วัน', u'ลง', u'ร่วม', u'ราย', u'รับ', u'ระหว่าง',
    u'รวม', u'ยัง', u'มี', u'มาก', u'มา', u'พร้อม', u'พบ', u'ผ่าน',
    u'ผล', u'บาง', u'น่า', u'นี้', u'นํา', u'นั้น', u'นัก', u'นอกจาก',
    u'ทุก', u'ที่สุด', u'ที่', u'ทําให้', u'ทํา', u'ทาง', u'ทั้งนี้', u'ทั้ง',
    u'ถ้า', u'ถูก', u'ถึง', u'ต้อง', u'ต่างๆ', u'ต่าง', u'ต่อ', u'ตาม',
    u'ตั้งแต่', u'ตั้ง', u'ด้าน', u'ด้วย', u'ดัง', u'ซึ่ง', u'ช่วง', u'จึง',
    u'จาก', u'จัด', u'จะ', u'คือ', u'ความ', u'ครั้ง', u'คง', u'ขึ้น',
    u'ของ', u'ขอ', u'ขณะ', u'ก่อน', u'ก็', u'การ', u'กับ', u'กัน',
    u'กว่า', u'กล่าว'
])
